# ref: https://github.com/Homebrew/homebrew-bundle

cask_args appdir: "/Applications"

tap "dart-lang/dart"
tap "homebrew/bundle"
tap "leoafarias/fvm"

# brews
brew "mysql"
brew "openjdk"
brew "openjdk@11"
brew "rbenv"
brew "zplug"
brew "leoafarias/fvm/fvm"

# casks
cask "android-studio"
cask "docker"
cask "google-chrome"
cask "notion"
cask "postman"
cask "sequel-ace"
cask "slack"
cask "visual-studio-code"
cask "warp"
cask "fork"

# vscode extensions
vscode "42Crunch.vscode-openapi"
vscode "aaron-bond.better-comments"
vscode "castwide.solargraph"
vscode "eamodio.gitlens"
vscode "Hridoy.rails-snippets"
vscode "janisdd.vscode-edit-csv"
vscode "kaiwood.endwise"
vscode "mechatroner.rainbow-csv"
vscode "misogi.ruby-rubocop"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "noku.rails-run-spec-vscode"
vscode "redhat.vscode-yaml"
vscode "shardulm94.trailing-spaces"
vscode "Shopify.ruby-lsp"
