# ref: https://github.com/Homebrew/homebrew-bundle

cask_args appdir: "/Applications"

tap "homebrew/bundle"

# brews
brew "rbenv"
brew "mysql"
brew "zplug"

# casks
cask "google-chrome"
cask "docker"
cask "sequel-ace"
cask "warp"
cask "fork"
cask "visual-studio-code"
cask "android-studio"
cask "notion"
cask "slack"

# vscode extensions
vscode "aaron-bond.better-comments"
vscode "castwide.solargraph"
vscode "eamodio.gitlens"
vscode "Hridoy.rails-snippets"
vscode "kaiwood.endwise"
vscode "misogi.ruby-rubocop"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "noku.rails-run-spec-vscode"
vscode "shardulm94.trailing-spaces"
vscode "Shopify.ruby-lsp"
